#### Terraform working directory 🏠: `demo/demo-account/demo-application/ebs`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ebs_volumes.module.ebs_volume["test-host/sdg"].aws_ebs_volume.this will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "test-host/sdg"
        }
      + tags_all          = {
          + "Name" = "test-host/sdg"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @Galvin-wjw
**Action**: pull_request
